src/cfe/archic41c_БСП.ТочкиИнтеграции/src/Catalogs/Интеграции/Интеграции.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Интеграции</name>
  <attributes>
    <name>КраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.ИнформационныеСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>Приемник</name>
    <type>
      <types>CatalogRef.ИнформационныеСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>Заказчик</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗапроса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаИнтеграцию</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусИнтеграции</name>
    <type>
      <types>EnumRef.СтатусыИнтеграции</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкиИнтеграции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокТочекИнтеграции</name>
    <attributes>
      <name>ИнициаторОбмена</name>
      <type>
        <types>CatalogRef.ИнформационныеСистемы</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеПотокаДанных</name>
      <type>
        <types>EnumRef.НаправленияПотокаДанных</types>
      </type>
    </attributes>
    <attributes>
      <name>МетодВызова</name>
      <type>
        <types>EnumRef.МетодыВызова</types>
      </type>
    </attributes>
    <attributes>
      <name>ТочкаИнтеграции</name>
      <type>
        <types>CatalogRef.ТочкиИнтеграции</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Функционал</name>
    <attributes>
      <name>Готова</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусИнтеграции</name>
      <type>
        <types>EnumRef.СтатусыИнтеграции</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cfe/archic41c_БСП.ТочкиИнтеграции/src/Catalogs/Интеграции/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДатаИзменения = ТекущаяДатаСеанса();
	
	Наименование = СтрШаблон(НСтр("ru = '[%1]->[%2]: %3'"), Источник, Приемник, КраткоеНаименование);
	
	// список точек интеграции в строке ТочкиИнтеграции
	МассивТочек = СписокТочекИнтеграции.ВыгрузитьКолонку("ТочкаИнтеграции");
	МассивТочек = ОбщегоНазначенияКлиентСервер.СвернутьМассив(МассивТочек);
	Если ЗначениеЗаполнено(МассивТочек) Тогда
		ТочкиИнтеграции = СтрСоединить(МассивТочек, "; ");
    Иначе
		ТочкиИнтеграции = "";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
